### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [1]:
# Dependencies and Setup
import pandas as pd
import numpy as np

# File to Load (Remember to Change These)
file_to_load = "purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data_pd = pd.read_csv(file_to_load)
purchase_data_df = pd.DataFrame(purchase_data_pd)
purchase_data_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [4]:
# Total Purchase count

total_purchases = purchase_data_pd["Purchase ID"].count()
total_purchases

780

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

## AGE PURCHASING ANALYSIS

In [68]:
# * Bin the purchase_data data frame by age


# * Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


# * Create a summary data frame to hold the results


# * Optional: give the displayed data cleaner formatting


# * Display the summary data frame

In [33]:
purchase_data_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [34]:
purchase_data_df["Age"].max()

45

In [35]:
purchase_data_df["Age"].min()

7

In [36]:
bins = [0, 9.99, 14.99, 19.99, 24.99, 29.99, 34.99, 39.99, 999]

In [37]:
# naming my bins

Group_names = ['<10' , '10-14' , '15-19' , '20-24' , '25-29', '30-34' , '35-39' , '40+' ]

In [38]:
purchase_data_df['Age Group'] = pd.cut(purchase_data_df.Age,bins, labels = Group_names)
purchase_data_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Group
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [39]:
purchase_AG = purchase_data_df.groupby(['Age Group'])

In [40]:
purchase_AG

In [41]:
Purchase_AG_Count = purchase_AG["Purchase ID"].count()

Purchase_AG_Count

Age Group
<10       23
10-14     28
15-19    136
20-24    365
25-29    101
30-34     73
35-39     41
40+       13
Name: Purchase ID, dtype: int64

In [42]:
Purchase_AG_sum = purchase_AG["Price"].sum()

Purchase_AG_sum

Age Group
<10        77.13
10-14      82.78
15-19     412.89
20-24    1114.06
25-29     293.00
30-34     214.00
35-39     147.67
40+        38.24
Name: Price, dtype: float64

In [45]:
AG_Price_Sign = Purchase_AG_sum.map("${:,.2f}".format)
AG_Price_Sign

Age Group
<10         $77.13
10-14       $82.78
15-19      $412.89
20-24    $1,114.06
25-29      $293.00
30-34      $214.00
35-39      $147.67
40+         $38.24
Name: Price, dtype: object

In [47]:
#avg price

Purchase_AG_avg = purchase_AG["Price"].mean()

Purchase_AG_avg

Age Group
<10      3.353478
10-14    2.956429
15-19    3.035956
20-24    3.052219
25-29    2.900990
30-34    2.931507
35-39    3.601707
40+      2.941538
Name: Price, dtype: float64

In [48]:
avg_AG_Price = Purchase_AG_avg.map("${:,.2f}".format)
avg_AG_Price

Age Group
<10      $3.35
10-14    $2.96
15-19    $3.04
20-24    $3.05
25-29    $2.90
30-34    $2.93
35-39    $3.60
40+      $2.94
Name: Price, dtype: object

In [53]:
Gr_per_person = purchase_data_df.groupby(['Age Group' , 'SN'])

In [54]:
AG_perperson = Gr_per_person["Price"].sum()
AG_perperson

Age Group  SN
<10        Adairialis76    NaN
           Adastirin33     NaN
           Aeda94          NaN
           Aela59          NaN
           Aelaria33       NaN
                            ..
40+        Yathecal82      NaN
           Yathedeu43      NaN
           Yoishirrala98   NaN
           Zhisrisu83      NaN
           Zontibe81       NaN
Name: Price, Length: 4608, dtype: float64

In [58]:
sum_AG_pp = AG_perperson.groupby('Age Group').sum()
sum_AG_pp

Age Group
<10        77.13
10-14      82.78
15-19     412.89
20-24    1114.06
25-29     293.00
30-34     214.00
35-39     147.67
40+        38.24
Name: Price, dtype: float64

In [59]:
count_AG_pp = AG_perperson.groupby('Age Group').count()
count_AG_pp

Age Group
<10       17
10-14     22
15-19    107
20-24    258
25-29     77
30-34     52
35-39     31
40+       12
Name: Price, dtype: int64

In [64]:
New_AG_Normalized = sum_AG_pp / count_AG_pp

New_AG_Normalized = New_AG_Normalized.map("${:,.2F}".format)

New_AG_Normalized

Age Group
<10      $4.54
10-14    $3.76
15-19    $3.86
20-24    $4.32
25-29    $3.81
30-34    $4.12
35-39    $4.76
40+      $3.19
Name: Price, dtype: object

In [65]:
AG_df = pd.DataFrame()
AG_df["Purchase Count"] = Purchase_AG_Count
AG_df["Average Purchase Price"] = avg_AG_Price
AG_df["Total Purchase Value"] = AG_Price_Sign
AG_df["Avg Tot Purchase PP"] = New_AG_Normalized

AG_df

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Tot Purchase PP
Age Group,,,,
<10,23,$3.35,$77.13,$4.54
10-14,28,$2.96,$82.78,$3.76
15-19,136,$3.04,$412.89,$3.86
20-24,365,$3.05,"$1,114.06",$4.32
25-29,101,$2.90,$293.00,$3.81
30-34,73,$2.93,$214.00,$4.12
35-39,41,$3.60,$147.67,$4.76
40+,13,$2.94,$38.24,$3.19

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [72]:
Spenders = purchase_data_df.groupby(['SN'])

In [81]:
Spenders_count = Spenders['Purchase ID'].count()
Spenders_count

SN
Adairialis76     1
Adastirin33      1
Aeda94           1
Aela59           1
Aelaria33        1
                ..
Yathecal82       3
Yathedeu43       2
Yoishirrala98    1
Zhisrisu83       2
Zontibe81        3
Name: Purchase ID, Length: 576, dtype: int64

In [85]:
Spenders_Price_sum = Spenders['Price'].sum()
Spender_Price_sum = Spenders_Price_sum.map("${:,.2F}".format)
Spender_Price_sum

SN
Adairialis76     $2.28
Adastirin33      $4.48
Aeda94           $4.91
Aela59           $4.32
Aelaria33        $1.79
                 ...
Yathecal82       $6.22
Yathedeu43       $6.02
Yoishirrala98    $4.58
Zhisrisu83       $7.89
Zontibe81        $8.03
Name: Price, Length: 576, dtype: object

In [86]:
Total_Purchase = Spender_Price_sum * Spenders_count
Total_Purchase

SN
Adairialis76               $2.28
Adastirin33                $4.48
Aeda94                     $4.91
Aela59                     $4.32
Aelaria33                  $1.79
                      ...
Yathecal82       $6.22$6.22$6.22
Yathedeu43            $6.02$6.02
Yoishirrala98              $4.58
Zhisrisu83            $7.89$7.89
Zontibe81        $8.03$8.03$8.03
Length: 576, dtype: object

In [90]:
Spender_df = pd.DataFrame()
Spender_df['Purchase Count'] = Spenders_count
Spender_df['Avg Purchase Price'] = Spender_Price_sum
Spender_df['Total Purchase Value'] = Total_Purchase
Spender_df

               Purchase Count Avg Purchase Price Total Purchase Value
SN
Adairialis76                1              $2.28                $2.28
Adastirin33                 1              $4.48                $4.48
Aeda94                      1              $4.91                $4.91
Aela59                      1              $4.32                $4.32
Aelaria33                   1              $1.79                $1.79
...                       ...                ...                  ...
Yathecal82                  3              $6.22      $6.22$6.22$6.22
Yathedeu43                  2              $6.02           $6.02$6.02
Yoishirrala98               1              $4.58                $4.58
Zhisrisu83                  2              $7.89           $7.89$7.89
Zontibe81                   3              $8.03      $8.03$8.03$8.03

[576 rows x 3 columns]

In [91]:
ascending = Spender_df.sort_values(by= 'Total Purchase Value' , ascending=False)
ascending.head()

              Purchase Count Avg Purchase Price Total Purchase Value
SN
Haillyrgue51               3              $9.50      $9.50$9.50$9.50
Phistym51                  2              $9.50           $9.50$9.50
Lamil79                    2              $9.29           $9.29$9.29
Aina42                     3              $9.22      $9.22$9.22$9.22
Saesrideu94                2              $9.18           $9.18$9.18

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [104]:

Item_df = purchase_data_df.groupby(["Item ID", "Item Name"])
Item_df.count()

,,Purchase ID,SN,Age,Gender,Price,Age Group
Item ID,Item Name,,,,,,
0,Splinter,4,4,4,4,4,4
1,Crucifer,3,3,3,3,3,3
2,Verdict,6,6,6,6,6,6
3,Phantomlight,6,6,6,6,6,6
4,Bloodlord's Fetish,5,5,5,5,5,5
...,...,...,...,...,...,...,...
179,"Wolf, Promise of the Moonwalker",6,6,6,6,6,6
180,Stormcaller,1,1,1,1,1,1
181,Reaper's Toll,5,5,5,5,5,5
182,Toothpick,3,3,3,3,3,3
183,Dragon's Greatsword,3,3,3,3,3,3

In [105]:
by_ITEM_df = Item_df["Purchase ID"].count()
by_ITEM_df

Item ID  Item Name
0        Splinter                           4
1        Crucifer                           3
2        Verdict                            6
3        Phantomlight                       6
4        Bloodlord's Fetish                 5
                                           ..
179      Wolf, Promise of the Moonwalker    6
180      Stormcaller                        1
181      Reaper's Toll                      5
182      Toothpick                          3
183      Dragon's Greatsword                3
Name: Purchase ID, Length: 183, dtype: int64

In [106]:
total_purchase = Item_df["Price"].sum()
total_purchase

total_purchase_sign = total_purchase.map("${:,.2f}".format)
total_purchase_sign

Item ID  Item Name
0        Splinter                            $5.12
1        Crucifer                            $9.78
2        Verdict                            $14.88
3        Phantomlight                       $14.94
4        Bloodlord's Fetish                  $8.50
                                             ...
179      Wolf, Promise of the Moonwalker    $26.88
180      Stormcaller                         $3.36
181      Reaper's Toll                       $8.30
182      Toothpick                          $12.09
183      Dragon's Greatsword                 $3.27
Name: Price, Length: 183, dtype: object

In [107]:
count_purchase = Item_df["Price"].count()
count_purchase

count_purchase_sign = count_purchase.map("${:,.2f}".format)
count_purchase_sign

Item ID  Item Name
0        Splinter                           $4.00
1        Crucifer                           $3.00
2        Verdict                            $6.00
3        Phantomlight                       $6.00
4        Bloodlord's Fetish                 $5.00
                                            ...
179      Wolf, Promise of the Moonwalker    $6.00
180      Stormcaller                        $1.00
181      Reaper's Toll                      $5.00
182      Toothpick                          $3.00
183      Dragon's Greatsword                $3.00
Name: Price, Length: 183, dtype: object

In [108]:
avg_purchase = Item_df["Price"].mean()
avg_purchase

avg_purchase_sign = avg_purchase.map("${:,.2f}".format)
avg_purchase_sign

Item ID  Item Name
0        Splinter                           $1.28
1        Crucifer                           $3.26
2        Verdict                            $2.48
3        Phantomlight                       $2.49
4        Bloodlord's Fetish                 $1.70
                                            ...
179      Wolf, Promise of the Moonwalker    $4.48
180      Stormcaller                        $3.36
181      Reaper's Toll                      $1.66
182      Toothpick                          $4.03
183      Dragon's Greatsword                $1.09
Name: Price, Length: 183, dtype: object

In [116]:
Bored_df = pd.DataFrame()
Bored_df['Purchase Count'] = by_ITEM_df
Bored_df['Avg Purchase Price'] = avg_purchase_sign
Bored_df['Total Purchase Value'] = total_purchase_sign
Bored_df

,,Purchase Count,Avg Purchase Price,Total Purchase Value
Item ID,Item Name,,,
0,Splinter,4,$1.28,$5.12
1,Crucifer,3,$3.26,$9.78
2,Verdict,6,$2.48,$14.88
3,Phantomlight,6,$2.49,$14.94
4,Bloodlord's Fetish,5,$1.70,$8.50
...,...,...,...,...
179,"Wolf, Promise of the Moonwalker",6,$4.48,$26.88
180,Stormcaller,1,$3.36,$3.36
181,Reaper's Toll,5,$1.66,$8.30
182,Toothpick,3,$4.03,$12.09
183,Dragon's Greatsword,3,$1.09,$3.27

In [120]:
Bored_df.sort_values("Purchase Count", ascending=False).head()

,,Purchase Count,Avg Purchase Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
145,Fiery Glass Crusader,9,$4.58,$41.22
108,"Extraction, Quickblade Of Trembling Hands",9,$3.53,$31.77
82,Nirvana,9,$4.90,$44.10
19,"Pursuit, Cudgel of Necromancy",8,$1.02,$8.16

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

In [125]:
Bored_df.sort_values(["Purchase Count","Total Purchase Value"], ascending=False).head()

,,Purchase Count,Avg Purchase Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
82,Nirvana,9,$4.90,$44.10
145,Fiery Glass Crusader,9,$4.58,$41.22
108,"Extraction, Quickblade Of Trembling Hands",9,$3.53,$31.77
19,"Pursuit, Cudgel of Necromancy",8,$1.02,$8.16